{
    "jobs": [
        {
            "id": "DUPd6IXZ2BKJUY27AAAAAA==",
            "title": "Web Developer",
            "company": "igus Inc.",
            "description": "GENERAL DESCRIPTION:\n\nThe Web Developer is responsible for planning, designing, coding, documenting, testing and maintaining custom web applications. In this role, the incumbent must facilitate productive relationships with a diverse constituency. The web developer assists in establishing and promoting common development methodologies and tools to ensure all local systems integrate with the broader IT infrastructure. The web developer collaborates with the team to promote standardization and efficiencies and to maintain a secure and reliable computing environment aligned with igus standards and industry best practices.\n\nRESPONSIBILITIES:\n• Work with the marketing and sales teams (US) and the web platform team (Germany) to implement digital projects, with a focus on e-commerce.\n• Develop and maintain online storefronts as well as other web applications using modern web stacks, in particular React.\n• Support in the integration and use of the content management system “Storyblok.”\n• Support in the implementation of solutions in ‘Salesforce Marketing Cloud’.\n• Identify and resolve issues related to igus’ online storefronts.\n• Write clean and efficient code using front-end and back-end technologies.\n• Support with technical problems or questions from customers and team members.\n• Stay abreast with both e-commerce and industry trends, emerging technologies, and web development tools.\n• Interpret non-technical users’ requests and requirements to generate user-friendly solutions quickly within the context of departmental initiatives.\n\nREQUIREMENTS:\n• BA/S in Computer Science or related field with a willingness to expand and develop technical experience and knowledge of Git.\n• An understanding of web infrastructure concepts (e.g. databases and cloud services) with deep knowledge of developing and maintaining database-driven web applications and management systems.\n• Demonstrated project management, planning, and process modeling skills as well as problem solving and debugging skills.\n• A strong curiosity and ability for learning new technologies (frameworks, programming languages, methodologies etc)\n• Proficiency with programming languages related to web application development, including HTML, CSS, PHP, JavaScript, Node.js, TypeScipt, etc.\n• Proficiency with application development frameworks\n• Experience with shell scripting.\n• Knowledge around customized Content Management Systems, Marketing Automation platforms, Customer-Relationship-Management systems as well as Git.\n• Willingness to participate in pair programming sessions with global developers to write, test, and debug code collaboratively.\n• Ability to work both independently and as a team member in a complex environment with competing demands, as well as collaborate remotely with international colleagues.\n• Strong communications skills and the ability to collaborate with non-technical users throughout all phases of project design and implementation.\n• Possesses a willingness and ability to support a diverse and inclusive environment.\n• Multiple extended stays to facilitate proper onboarding and training at the HQ office in Cologne (3-5 months total)\n\nBENEFITS:\n• Competitive base salary with ongoing growth opportunities\n• Complete benefits package:\n• Co. paid HSA Medical plan\n• Co. paid Dental\n• Co. paid Life\n• Supplemental Life Insurance\n• Vision Insurance\n• Short and Long Term Disability Insurance\n• Retirement with Company contributions\n• 20 Paid Time Off days per year, plus 9 holidays\n• Subsidized lunch on-site\n\n#INDSJ",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQQ_KyuCPGeaFBuFe7O_VGSkAhF--Xvw-rOlMGS&s=0",
            "location": "East Providence, RI, United States",
            "employmentType": "Full-time",
            "datePosted": "2 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://www.linkedin.com/jobs/view/web-developer-at-igus-inc-4127760382?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Indeed",
                    "url": "https://uk.indeed.com/viewjob?jk=d2b823cc433fa8e1&from=career-explorer-jobs-card&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Monster",
                    "url": "https://www.monster.com/job-openings/web-developer-rumford-ri--3f9b1781-7ea2-46f6-90cd-b7810ef9670c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/igus,-Inc/Job/Web-Developer/-in-Rumford,RI?jid=391dbaaf8c779746&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/web-developer-igus-inc-JV_IC1151293_KO0,13_KE14,22.htm?jl=1009601949286&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "SimplyHired",
                    "url": "https://www.simplyhired.com/job/ATVitZRzLfCizlf_MKMKzLc-BwQtSDVo2F1WhKclRokNW1HMgv_rzg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "UpJobber.com",
                    "url": "https://www.chupjobber.com/?refId=2IjE31830SIUPWZQdLccuw%3D%3D&trackingId=G5vjA61oLEqz9qTwwg0qyA%3D%3D&_=/jobs/view/web-developer-at-igus-inc-4127760382%23KJWqMdlUlBn8PPpbXBTujI7xcY8uGFCs&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "pnv6iG6XIzhnf5yzAAAAAA==",
            "title": "Junior Web Developer",
            "company": "Scopic",
            "description": "A company is looking for a Remote Junior Web Developer.Key ResponsibilitiesDevelop and maintain web applications using various technologies\nCollaborate with a global team to deliver innovative solutions\nEngage in continuous learning and professional development opportunitiesRequired Qualifications1+ year of software development experience\nExperience with full-stack development\nFluency in one or more back-end languages (PHP/Node.js/Python/C#)\nProficiency in JavaScript and familiarity with frameworks (e.g., Laravel, Django, React, Angular)\nBachelor's degree or higher",
            "image": "",
            "location": "Ogden, UT, United States",
            "employmentType": "Full-time",
            "datePosted": "8 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Media Bistro",
                    "url": "https://www.mediabistro.com/jobs/686363335-junior-web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "Yrn51BIgR5qg2RjZAAAAAA==",
            "title": "Web Developer",
            "company": "General Dynamics Information Technology",
            "description": "Deliver simple solutions to complex problems as a Web Developer at GDIT. Here, you’ll tailor cutting-edge solutions to the unique requirements of our clients. With a career in application development, you’ll make the end user’s experience your priority and we’ll make your career growth ours.\n\nAt GDIT, people are our differentiator. As a Web Developer you will help ensure today is safe and tomorrow is smarter. Our work depends on a Web Developer joining our team to contribute to our nation’s security by protecting us from some of the most dangerous global threats.\n\nThe Defense Threat Reduction Agency’s (DTRA) Operational Information Management System (OIMS) is the hub of integrating information on DTRA’s global operations and tracking DTRA’s activities in support of the Department of Defense’s mission to deter, prevent and prevail against weapons of mass destruction threats. GDIT is seeking motivated and qualified individuals to support the operational functions of OIMS, as well as individuals to maintain, develop and modernize OIMS’ IT infrastructure. As a Web Developer, you will play a leading role in the design and modernization of the web-based applications that support DTRA OIMS.\n\nHOW A WEB DEVELOPER WILL MAKE AN IMPACT:\n• Develops, codes, deploys, and maintains web applications and websites.\n• Tests and creates contingency plans for optimal website usability and connectivity\n• Provides guidance for the analysis of customer requirements for websites according to the client's wide range of highly complex specifications and needs\n• Provides guidance and collaborates with graphics and web designers to develop web applications and websites\n• Provides thorough testing and guidance for the finalization of web applications and websites for next level production\n• Maintains and recommends highly complex updates to websites ensuring changes are implemented without disruption\n• Creates and implements highly complex contingency plans in preparation of website outages\n• Builds upon current knowledge and provides guidance on emerging and relevant programming that will enhance web applications and websites overall functionality\n• Provides guidance and leadership to less-experienced web developer personnel\n• May serve as a team or task leader.\n\nWHAT YOU’LL NEED TO SUCCEED:\n• EDUCATION AND EXPERIENCE: Technical Training, Certification(s) or Degree, 3+ years of experience\n• Ability to maintain existing ColdFusion applications, including providing direct support to users and customers (Desired)\n• Experience coding, designing and optimizing high-traffic, mission-critical apps in a classified environment (Required)\n• Must know other web languages which include at least one of the following: HTML, CSS, XML, JavaScript, SQL\n• Maintain and enhance current environment; must be able to follow directions of app enhancements, upgrades, patches, etc.\n• Experienced creating data search queries on relational database sources (e.g. Oracle and SQL) and geographical data apps (e.g., Esri ArcGIS and Google Earth) (Desired)\n• Experience with Python Django, Flask or other related frameworks (Required)\n• Experience with Java Spring Boot, React preferably with NextJs and Angular (Required)\n• Secret security clearance (Required)\n• Location: Hybrid, On Customer Site\n• US Citizenship Required\n\nCERTIFICATIONS:\n• Must meet 8570.01M IAT II certification requirements (Required)\n\n#armajobs",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTa_IZekv4BGc92tU1UmD9gU2_VlzG_zIgrME9U&s=0",
            "location": "Fort Belvoir, VA, United States",
            "employmentType": "Full-time",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "GDIT",
                    "url": "https://www.gdit.com/careers/job/d02da5135/web-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "CareerOneStop",
                    "url": "https://www.careeronestop.org/GetMyFuture/Toolkit/find-jobs-details.aspx?keyword=Web+Developers&location=United+States&fc=1&jvid=c1635b1f839043ce9257b5f24f2f34f58003&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Workday",
                    "url": "https://gdit.wd5.myworkdayjobs.com/en-US/External_Career_Site/job/Web-Developer_RQ188161?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Clearance Jobs",
                    "url": "https://www.clearancejobs.com/jobs/7988418/web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Indeed",
                    "url": "https://www.indeed.com/viewjob?jk=3cdaf68c95473577&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/General-Dynamics/Job/Web-Developer/-in-Fort-Belvoir,VA?jid=f3bfacf8f17bcb98&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Ladders",
                    "url": "https://www.theladders.com/job/web-developer-generaldynamics-fort-belvoir-va_78328387?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "USNLX Diversity Jobs - National Labor Exchange",
                    "url": "https://diversity.usnlx.com/fort-belvoir-va/web-developer/C1635B1F839043CE9257B5F24F2F34F5/job/?vs=28&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "gW_JGyjHkks90GdvAAAAAA==",
            "title": "Front End Web Developer",
            "company": "Guidehouse",
            "description": "A company is looking for a Front End Web Developer to provide web development support for the National Institute of Nursing Research.Key ResponsibilitiesInterface with staff to gather project requirements and execute project plans\nDesign, develop, document, and modify computer systems and applications\nSupport and maintain scientific computer systems and ensure security complianceRequired QualificationsBachelor's degree\nAt least four (4) years of experience in website development and design\nExperience with web technologies such as JavaScript, CSS3, and HTML5\nFamiliarity with content management systems like Drupal and tools like GitHub\nKnowledge of digital communications federal compliance standards is a plus",
            "image": "",
            "location": "Alexandria, VA, United States",
            "employmentType": "Full-time",
            "datePosted": "8 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Media Bistro",
                    "url": "https://www.mediabistro.com/jobs/686484377-front-end-web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Talent.com",
                    "url": "https://www.talent.com/view?id=6879809f25d2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "xZlDXErKuYOQaKsBAAAAAA==",
            "title": "Web User Interface Developer",
            "company": "CEI",
            "description": "Job Title: UI Developer\n\n12 Month C2H\n\n$65/hr-$75/hr (W2H)\n\nJob Summary\n\nWe are seeking a talented and detail-oriented UI Developer to create visually stunning and user-friendly interfaces for our web applications. The ideal candidate will possess a deep understanding of design principles, front-end technologies, and a passion for enhancing user experiences. As a UI Developer, you will collaborate closely with cross-functional teams to bring designs to life and ensure seamless, intuitive interactions for our users.\n\nKey Responsibilities\n• Develop and maintain responsive user interfaces using HTML, CSS, and JavaScript frameworks.\n• Collaborate with UX designers to transform wireframes and prototypes into fully functional, interactive user interfaces.\n• Optimize applications for maximum performance, speed, and scalability across various devices and browsers.\n• Conduct user testing and gather feedback to refine and improve UI designs.\n• Troubleshoot and resolve any UI-related issues to ensure a smooth user experience.\n• Ensure cross-browser compatibility and adhere to industry best practices.\n• Stay informed about emerging technologies and industry trends, incorporating the latest innovations into your work.\n\nQualifications\n• Bachelor's degree in Computer Science, Design, or a related field (or equivalent practical experience).\n• Proven experience as a UI Developer or in a similar role, with a strong portfolio showcasing your work.\n• Expertise in front-end technologies, including HTML5, CSS3, and JavaScript.\n• Experience with modern UI frameworks such as React, Angular, or Vue.js.\n• Strong understanding of responsive design principles and web accessibility standards.\n• Excellent problem-solving skills, attention to detail, and ability to handle complex design challenges.\n\nPreferred Skills\n• Familiarity with version control systems (e.g., Git).\n• Experience with CSS preprocessors like SASS or LESS.\n• Basic knowledge of back-end technologies (e.g., Node.js, PHP) is a plus.\n\nDesign Skills & Thinking\n• The ideal candidate should have some experience with design tools and design thinking, even if it's not extensive.\n• Looking for skills such as Figma, Sketch, or even Photography. This is valuable as it will help guide UI direction without requiring constant back-and-forth discussions between teams.\n\nAngular & Web Standards\n• Knowledge of Web Standards and Accessibility (ADA/ARIA) is crucial. Following proper web standards and ensuring accessibility will lead to more maintainable, high-quality code.\n• We are looking for candidates with 5+ years of Angular experience, especially those who focus on web standards and accessible design.\n\nNodeJS Experience\n• NodeJS is increasingly important for our projects, especially going forward.\n\nTechnical Requirements\n• Candidate must have at least 5 years of experience in front-end development with strong proficiency in HTML5, CSS3, and JavaScript.\n• Candidate must have at least 5 years of experience working with modern front-end frameworks, such as Angular, React, or Vue.js.\n• Candidate must have experience with web accessibility standards (ADA/ARIA) and ensure cross-browser compatibility in UI development, with at least 2 years of practical application.",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSYTV6pM3bXi5IwDSMWIdd1fuodAaFhfYji4qOv&s=0",
            "location": "Orlando, FL, United States",
            "employmentType": "Full-time",
            "datePosted": "21 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://www.linkedin.com/jobs/view/web-user-interface-developer-at-cei-4128407076?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "zlYDxgeioIqqNN78AAAAAA==",
            "title": "Web Developer Back-End",
            "company": "Southern New Hampshire University",
            "description": "Web Developer Back-End\n• Full time\n• January 08, 2025\n• Remote\n\nDescription\nSouthern New Hampshire University is a team of innovators. World changers. Individuals who believe in progress with purpose. Since 1932, our people-centered strategy has defined us — and helped us grow a team that now serves over 180,000 learners worldwide.\n\nOur mission to transform lives is made possible by talented people who bring diverse industry experience, backgrounds and skills to the university. And today, we're ready to expand our reach. All we need is you.\n\nMake an impact — from near or far\n\nAt SNHU, you'll have the option to work remotely in the following states: Alabama, Arizona, Arkansas, Delaware, Florida, Georgia, Hawaii, Idaho, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Mississippi, Missouri, Nebraska, New Hampshire, New Mexico, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, West Virginia, Wisconsin and Wyoming.\n\nWe ask that our remote employees have access to a reliable internet connection and a dedicated, properly equipped workspace that is free of distractions. Employees must reside in, and work from, one of the above approved states.\n\nThe opportunity\n\nJob Description\nThe Web Developer (Back End) will report to the Director of Web Development. You will design, develop, maintain, and improve SNHU's web experiences. You will provide a variety of web application development services for a creative university and will improve the functionality and effectiveness of the university web properties with a laser focus on detail and provide guidance to fellow development team members. This role is Hybrid. #LI-Hybrid. Expected days in the office will be very limited, with the potential of once or twice a month as needed by the business. This may change in the future as well.\n\nWhat you'll do:\n• Build modular ASP.NET MVC web controls and components following OOP best practices\n• Develop data models and templates used to represent website content\n• Assess and remedy performance issues\n• Implement UI, SEO, accessibility, usability, and performance best practices with equal importance.\n• Maintain our web applications and servers\n• Support functionality and monitor the collection of lead data and processing\n• Contribute, develop, and follow detailed technical specifications\n• Communicate updates and resolutions to product owners, team leads, QA, project managers, and internal partners to facilitate accurate deliverables\n• Foster a culture of collaboration, knowledge sharing, and learning within the development team\n• Perform code reviews and validate changes within pull requests\n• Scope and estimate deliverables\n• Provide technical staff assistance\n• Develop application solutions, enhancements, and database integrations for Sitecore, Azure, and legacy systems\n• Solve system challenges through analysis of data and knowledge of database systems, programming languages, network software, hardware, protocols, and policies at SNHU\n\nWe would like to see:\n• Three years of experience in web development\n• 5+ years of equivalent experience in lieu of degree acceptable\n• Requires the versatility to work well independently and within a team\n• Development skills in: HTML, CSS/SASS, JavaScript, C#, SQL.\n• Working knowledge of Web browsers (Edge, Firefox, Chrome, Safari), Windows, iOS\n• Experience writing SQL server queries and stored procedures\n• Master new technologies. SNHU uses Visual Studio, Sitecore, Azure, SQL Server, GIT, nUnit\n• Proficiency at writing reusable and modular code\n\nAdditional experience with:\n• Experience with A/B testing, and implementing A/B and multivariate tests on landing pages\n• Proficiency in Google Tag Manager\n• Experience with Tracking campaign activity\n• Familiarity with Agile Scrum or Kanban development lifecycles.\n• Experience with any enterprise level CMS, SharePoint, Salesforce, Google Search Console and Google Analytics\n• Familiarity with ADA/WCAG standards\n• Experience with build automation systems and deployment such as Azure DevOps\n• Experience with JavaScript libraries such as React\n\nWe believe real innovation comes from inclusion - where different experiences, perspectives and talents are celebrated. So if you're wondering whether SNHU is right for you, take the leap and apply. You might be just the person we're looking for.\n\nCompensationThe annual pay range for this position is $91,388.00 - $146,247.00. Actual offer will be based on skills, qualifications, experience and internal equity, in addition to relevant business considerations. We expect this position to be hired in the following target hiring range $100,983.00 - $136,624.00.\n\nExceptional benefits (because you’re exceptional)\n\nYou’re the whole package. Your benefits should be, too. As a full-time employee at SNHU, you’ll get:\n• High-quality, low-deductible medical insurance\n• Low to no-cost dental and vision plans\n• 5 weeks of paid time off (plus almost a dozen paid holidays)\n• Employer-funded retirement\n• Free tuition program\n• Parental leave\n• Mental health and wellbeing resources",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRrRPViRy4CVXOJ7upHtwLjXZuuC5PckLbXOKG6&s=0",
            "location": "New Hampshire, United States",
            "employmentType": "Full-time",
            "datePosted": "4 days ago",
            "salaryRange": "US$91,388–US$146,247 a year",
            "jobProviders": [
                {
                    "jobProvider": "Edtech.com",
                    "url": "https://www.edtech.com/jobs/web-developer-back-end-9979?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "hZlXkDyA73jBxZICAAAAAA==",
            "title": "Web Developer",
            "company": "Aleto, Inc.",
            "description": "A company is looking for a Web Developer for a remote, full-time, mid-level position.\nKey ResponsibilitiesDevelop and maintain dynamic web applications using PHP, Angular, and .NET\nCollaborate with cross-functional teams to design and implement new features while ensuring optimal performance\nTroubleshoot issues, enhance legacy systems for browser compatibility, and maintain technical documentationRequired QualificationsMust be authorized to work in the U.S. and able to obtain a Public Trust Security Clearance\nBachelor's degree in Information Systems, IT, or related field with 5-7 years of relevant experience\nProficiency in PHP, Angular, TypeScript, C#, ASP.NET, .NET Core 5+, HTML5, CSS 3.0, JavaScript, jQuery, and Bootstrap\nExperience with RESTful APIs and knowledge of version control systems like Git\nPrior experience in federal consulting engagements is preferred",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRqocFLZuoFvd6U3LhSOzL1LAQg1yiVwP8htgh7&s=0",
            "location": "Winston-Salem, NC, United States",
            "employmentType": "Full-time",
            "datePosted": "8 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Media Bistro",
                    "url": "https://www.mediabistro.com/jobs/686477140-web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "SimplyHired",
                    "url": "https://www.simplyhired.com/job/zZcfR6wyF1gfF-64OWtydERF5ovkeYqWra5dctWWXJm6fsoltcXByg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "J And J Body Shop",
                    "url": "https://jjbodyshop.com/workspread/job/web-developer-at-infinity-consulting-solutions-inc-winston-salem-nc-27107-f16995bc87d0ac01jktk-ampib2R5c2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "5AIu_f753pMoFrOXAAAAAA==",
            "title": "Backend PHP Developer",
            "company": "Web Hosting Canada (WHC)",
            "description": "At Web Hosting Canada (WHC), we are passionate about helping Canadians succeed online with reliable, locally focused web hosting services. Since 2003, we’ve been empowering businesses and individuals with top-notch websites, domains, and email solutions. We’re on a mission to create a workplace that inspires growth, fosters innovation, and builds meaningful connections. If you thrive in a dynamic, caring environment and share our excitement for the tech landscape, we’d love to have you join our team!\n\nAbout The Role\n• As a Backend PHP Developer working at WHC, you’ll be participating in building, improving and expanding WHC’s systems to help small businesses make the most out of their online presence.\n\nWhat You'll Do\n• Building new features and improvements for WHC's management platform (ERP)\n• Building new features and improvements for WHC's client-facing web platform\n• Troubleshooting and resolving incoming bugs within our production environment\n• Improving our Managed WordPress hosting application, including WordPress plugin development\n\nQualifications\n• 2+ years experience with PHP web development\n• 2+ years experience working with JavaScript and jQuery\n• 2+ years experience working with MySQL and comfortable building complex SQL queries\n• Experience with code versioning tools such as Git\n• Knowledge of Bash scripting and command-line server management, an asset\n• Having completed a minimum of 3-year University level degree in Computer Science, Software/Computer Engineering, or equivalent degree\n• Good working knowledge of English and/or French both written and oral communication\n• Must pass a security background check",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRznC10ElH1wI0k4xwtPpbYwYL6UmGOFmLAdfWF&s=0",
            "location": "United States",
            "employmentType": "Full-time",
            "datePosted": "1 day ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "LinkedIn",
                    "url": "https://www.linkedin.com/jobs/view/backend-php-developer-at-web-hosting-canada-whc-4128018714?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "JobLeads",
                    "url": "https://www.jobleads.com/us/job/php-backend-developer--united-states--e11b8c9ffbb8e4dc2c906b63e516a5f93?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "nxy8b-iwW0fv0foJAAAAAA==",
            "title": "Full Stack Web Developer",
            "company": "EPATHUSA",
            "description": "A company is looking for a Web Developer (full stack) to work remotely on a contract basis.Key ResponsibilitiesDesign, develop, and optimize scalable web applications using modern front-end technologies\nBuild and maintain a new application for the summer EBT program and provide ongoing support and enhancements\nCollaborate with back-end teams to ensure seamless integration and functionality of applicationsRequired Qualifications5+ years of professional experience in full stack web development\n3+ years of front-end development experience using React and Next.js\nProficiency in SQL and experience with complex queries and database management\nExperience with testing frameworks like Jest and Mocha\nAbility to write clean, maintainable, and well-documented code adhering to best practices",
            "image": "",
            "location": "Portland, OR, United States",
            "employmentType": "Full-time",
            "datePosted": "8 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "jobProvider": "Media Bistro",
                    "url": "https://www.mediabistro.com/jobs/686483890-full-stack-web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "JobzMall",
                    "url": "https://www.jobzmall.com/ebay/job/full-stack-web-services-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "BeBee",
                    "url": "https://us.bebee.com/job/122f349f320168f40ee40c2c96ff0f4e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        },
        {
            "id": "eykz4B8WOqaeiFnnAAAAAA==",
            "title": "Web Developer",
            "company": "Youngstown State University (OH)",
            "description": "Plans, designs, and develops web assets, templates, digital content, and brand standards within the guidelines, frameworks, best practices, policies, and restraints of university wide content management systems.\n\nEssential Functions and Responsibilities: Provides front-end development working with Drupal content management system. Assists with development of user interface designs.\n\nWrites and implements code in HTML5, CSS3, and JavaScript/jQuery to enhance website functionality. Works with graphic and web development tools to design website elements in CMS.\n\nCreates web applications using Drupal Webform or Views.\n\nTroubleshoots issues related to design and functionality of websites.\n\nWorks on projects initiated by departmental request; includes meeting with department representatives as needed in order to establish goals and objects. Provides ongoing communication with departments from inception to implementation of project, as well as ongoing support as needed.\n\nEnsures quality control of content in terms of spelling, grammar, and general readability. Ensures that code meets ADA standards.\n\nMonitors, evaluates and recommends web design standards, updates, features and conventions to be utilized for technical and brand standards.\n\nWorks closely with other members of the web team on projects where needed. Interacts with student developers in an educational or support capacity as needed.\n\nRecommends modules where appropriate.\n\nOther Functions and Responsibilities: Assists with training new hires.\n\nPerforms other related duties as assigned.\n\nWork Schedule: Typically, Monday through Friday.\n\nSupervision Exercised: May exercise supervision over student employees.\n\nReports to: Director, Marketing and Communications\n\nRequired Certifications, Training, and/or Licensures: None\n\nKnowledge, Skills, and Abilities:\n\nKnowledge of: University policies and procedures*; office practices and procedures; department/division goals and objectives*; department/division policies and procedures*; workplace safety practices and procedures*; English grammar and spelling; records management; office management; project management.\n\nSkill in: Use of office equipment; typing, data entry; computer operation; use of computer software and other programs applicable to the assigned department/division*.\n\nAbility to: Collect data, establish facts, and draw valid conclusions; determine material and equipment needs; compile and prepare reports; use proper research methods to gather data; understand a variety of written and/or verbal communications; maintain records according to established procedures; effectively interact with personnel and public to answer routine questions; train or instruct others; move quickly and effectively from one tasks to another; work independently and in a team environment; develop and maintain effective working relationships.\n\n(*) Developed after employment.\n\nMinimum Qualifications: At least a bachelor’s degree in computer science, computer information systems, web design, interactive media design, or another related field. Two or more years of experience in front end front-end user interface design, user experience design, and/or dynamic website development. Ability to code in HTML5, CSS3, and JavaScript/jQuery. Experience or familiarity with Bootstrap framework. An understanding of responsive website design. Working knowledge, including coursework or online tutorials, of flexbox layout. Experience creating web forms. Familiarity with website accessibility compliance, i.e. ADA Compliance. Customer service experience.\n\nPreferred Qualifications: Experience working with Drupal Content Management System. Experience working with WordPress Content Management System, specifically utilizing Elementor page builder. Familiarity with UI/UX design tools such as Adobe XD and/or Figma. Familiarity with image editing tools such as Adobe Photoshop and/or GIMP.",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSvI2i8yw-pV5bCQms2pppCa8C9wiXpScyEAUwA&s=0",
            "location": "Youngstown, OH, United States",
            "employmentType": "Full-time",
            "datePosted": "",
            "salaryRange": "US$35,780–US$42,050 a year",
            "jobProviders": [
                {
                    "jobProvider": "GovernmentJobs.com",
                    "url": "https://www.governmentjobs.com/jobs/4600204-0/web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Indeed",
                    "url": "https://www.indeed.com/viewjob?jk=fd72eea06820c178&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Youngstown-State-University,-OH/Job/Web-Developer/-in-Youngstown,OH?jid=197e4fbc19aa7caf&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/web-developer-youngstown-state-university-JV_IC1146406_KO0,13_KE14,41.htm?jl=1009386169084&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "SimplyHired",
                    "url": "https://www.simplyhired.com/job/3zuKPMJ64gYAXbBBZwwyh6WT3nUYK68WaBAixHa9NFiAm1qb13xPXg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "LazyApply",
                    "url": "https://lazyapply.com/jobpreview/job_39649c5f5ac73097?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "jobProvider": "Jobilize",
                    "url": "https://www.jobilize.com/job/us-oh-youngstown-web-developer-state-university-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ]
        }
    ],
    "index": 0,
    "jobCount": 10,
    "nextPage": "RXJjREN2Y0NRVXBIT1VwclQyUkpZeTFuWlc1Qlp6VlBRVWRaVjNoWFJ6VlBiMU5MTWw4eFIwaGpiMDlqZERnNGFVMXBiV2xmY0ZoR1pUVjNWbE5zVkVkRGNIYzFjVEZvWWsxRVdFUk9WMlZTU0hCNlFtZzBjM0p4Ulc1cmJtcEJRbk50TTJvd1FtUktVakppU2kxQ1QyMDBOR1JYVjNKZmVFNTFRbkpoTm5RMVowTkpaVXBpVjNsV1ltdEtUVXhIZW1sUVQwMVpNVkYwU0hOT1NqSnJRVzlRTjBkWmFYRklUMlYzTUMweE9YTm9kbVJXYzI1VmJFMHRXa1ZxU1RjMWJrTnpjRlJNVTNwb2FESkRObVptUWkxMWJVbG5jMGRpY2sxNFdWa3pZbUpYT1dSaE1UY3pYMkpYZWxrNWFEVjRka1ZwWW5CT2JrRjFXSFJZWWw5b1MycExSRVptZW5KUmNFZGxYMHR5WTIxcGFsZFZMVzExUmpSVFlrRmtjWG8xVFY5UU5tOWFRMFE1ZWprd1dFWnBYMlo1ZDNsTk9HZGtkelJ1WTFOWFFUWTROMjFGVlZGamJqWjRiR2xOZVV0U2FESjZWVU5YTm5WNVkzUklha0ZRZUZwbFZtRktNMkZPTFVKTk5VWjRNbEF3VWtFMlowZHRWRWRwV2t0akVoZDRMV0ZNV2w4eVdFdGxSMFl3VUVWUWNtUXlkbWxSWXhvaVFVWllja1ZqYjJSSlZHWndhMHhYWDBaUWFITldWRVJ3V1ZkME1GRldRVnBZZHclM0JmY194LWFMWl8yWEtlR0YwUEVQcmQydmlRY18yJTNCMQ==",
    "hasError": false,
    "errors": []
}